# Data Visualization with Modern Data Science

> Data Manipulation and Definition with SQL

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com)

In [1]:
%LOAD sqlite3 db=data/covid19.db timeout=2 shared_cache=true

## (Recap)Subcategories of SQL

- DQL, short for **Data Query Language**.
- DML, short for **Data Manipulation Language**.
- DDL, short for **Data Definition Language**.
- DCL, short for **Data Control Language**.
- TCL, short for **Transaction Control Language**.

## (Recap)Subcategories of SQL(Cont'd)

- DQL: statements begin with `SELECT`.
- DML: statements begin with `INSERT`, `UPDATE`, `DELETE`...etc.
- DDL: statements begin with `CREATE`, `DROP`, `ALTER`...etc.
- DCL: statements begin with `GRANT`, `REVOKE`...etc.
- TCL: statements begin with `COMMIT`, `ROLLBACK`...etc.

## (Recap)What will be covered in this course

- DQL.
- A bit of DML.
- A bit of DDL.
- ~~DCL.~~
- A little bit of TCL.

## Data Manipulation with SQL

## DML(Data Manipulation Language)

- `INSERT`
- `DELETE`
- `UPDATE`

## `INSERT` statement

```sql
INSERT INTO table_name (column_names, ...)
VALUES (values, ...);
```

## Before `INSERT` statement

In [2]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4010     |
+----------+
1 row in set (0.00 sec)

In [3]:
PRAGMA foreign_keys=off;

In [4]:
INSERT INTO daily_report (Combined_Key, Last_Update, Confirmed, Deaths)
VALUES ('The Artificial Place', '2022-03-01 00:00:00', 7788, 5566);

In [5]:
PRAGMA foreign_keys=on;

## After `INSERT` statement

In [6]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4011     |
+----------+
1 row in set (0.00 sec)

In [7]:
SELECT *
  FROM daily_report
 WHERE Combined_Key = 'The Artificial Place';

+----------------------+---------------------+-----------+--------+
| Combined_Key         | Last_Update         | Confirmed | Deaths |
+----------------------+---------------------+-----------+--------+
| The Artificial Place | 2022-03-01 00:00:00 | 7788      | 5566   |
+----------------------+---------------------+-----------+--------+
1 row in set (0.00 sec)

## Multiple `INSERT`s

```sql
INSERT INTO table_name (column_names, ...)
VALUES
(values, ...),
(values, ...);
```

## Before multiple `INSERT` statements

In [8]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4011     |
+----------+
1 row in set (0.00 sec)

In [9]:
PRAGMA foreign_keys=off;

In [10]:
INSERT INTO daily_report (Combined_Key, Last_Update, Confirmed, Deaths)
VALUES
('The Good Place', '2022-03-01 00:00:00', 0, 0),
('The Bad Place', '2022-03-01 00:00:00', 7788, 5566);

In [11]:
PRAGMA foreign_keys=on;

## After multiple `INSERT` statements

In [12]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4013     |
+----------+
1 row in set (0.00 sec)

In [13]:
SELECT *
  FROM daily_report
 WHERE Combined_Key Like 'The%Place';

+----------------------+---------------------+-----------+--------+
| Combined_Key         | Last_Update         | Confirmed | Deaths |
+----------------------+---------------------+-----------+--------+
| The Artificial Place | 2022-03-01 00:00:00 | 7788      | 5566   |
+----------------------+---------------------+-----------+--------+
| The Good Place       | 2022-03-01 00:00:00 | 0         | 0      |
+----------------------+---------------------+-----------+--------+
| The Bad Place        | 2022-03-01 00:00:00 | 7788      | 5566   |
+----------------------+---------------------+-----------+--------+
3 rows in set (0.00 sec)

## `DELETE` statement

```sql
-- delete all records in a table
DELETE FROM table_name;
-- delete specific records in a table
DELETE FROM table_name
 WHERE conditions;
```

## Before `DELETE` statement

In [14]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4013     |
+----------+
1 row in set (0.00 sec)

In [15]:
PRAGMA foreign_keys=off;

In [16]:
DELETE FROM daily_report
 WHERE Combined_Key LIKE '%Place';

In [17]:
PRAGMA foreign_keys=on;

## After `DELETE` statement

In [18]:
SELECT COUNT(*)
  FROM daily_report;

+----------+
| COUNT(*) |
+----------+
| 4010     |
+----------+
1 row in set (0.00 sec)

## `UPDATE` statement

```sql
UPDATE table_name
   SET column_names = values,
       column_names = values
 WHERE conditions;
```

## Before `UPDATE` statement

In [19]:
SELECT *
  FROM lookup_table
 WHERE Country_Region = 'Taiwan';

+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
| UID | Combined_Key | iso2 | iso3 | Country_Region | Province_State | Admin2 | Lat  | Long_ | Population |
+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
| 158 | Taiwan       | TW   | TWN  | Taiwan         | NULL           | NULL   | 23.7 | 121   | 23816775   |
+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
1 row in set (0.00 sec)

In [20]:
UPDATE lookup_table
   SET Lat = 23.69,
       Long_ = 120.96
 WHERE Country_Region = 'Taiwan';

## After `UPDATE` statement

In [21]:
SELECT *
  FROM lookup_table
 WHERE Country_Region = 'Taiwan';

+-----+--------------+------+------+----------------+----------------+--------+-------+--------+------------+
| UID | Combined_Key | iso2 | iso3 | Country_Region | Province_State | Admin2 | Lat   | Long_  | Population |
+-----+--------------+------+------+----------------+----------------+--------+-------+--------+------------+
| 158 | Taiwan       | TW   | TWN  | Taiwan         | NULL           | NULL   | 23.69 | 120.96 | 23816775   |
+-----+--------------+------+------+----------------+----------------+--------+-------+--------+------------+
1 row in set (0.00 sec)

## Another `UPDATE` to undo the previous `UPDATE`

In [22]:
UPDATE lookup_table
   SET Lat = 23.7,
       Long_ = 121.0
 WHERE Country_Region = 'Taiwan';

In [23]:
SELECT *
  FROM lookup_table
 WHERE Country_Region = 'Taiwan';

+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
| UID | Combined_Key | iso2 | iso3 | Country_Region | Province_State | Admin2 | Lat  | Long_ | Population |
+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
| 158 | Taiwan       | TW   | TWN  | Taiwan         | NULL           | NULL   | 23.7 | 121   | 23816775   |
+-----+--------------+------+------+----------------+----------------+--------+------+-------+------------+
1 row in set (0.00 sec)

## Data Definition with SQL

## DDL(Data Definition Language)

- `CREATE` tables.
- `CREATE` views.

## What are tables?

> A table is a collection of related data held in a table format within a database. It consists of columns and rows.In relational databases, and flat file databases, a table is a set of data elements (values) using a model of vertical columns (identifiable by name) and horizontal rows, the cell being the unit where a row and column intersect. A table has a specified number of columns, but can have any number of rows.

Source: <https://en.wikipedia.org/wiki/Table_(database)>

## Planning a database

1. Design questions.
2. Data questions.
3. Security questions.

## Design questions

- What are the business requirements?
- What tables will I need to fulfill those requirements?
- What columns will each table contain?
- ...etc.

## Data questions

- How much data will be populated into these tables?
- Where will the data come from?
- Do we need processes to automatically populate the tables?
- ...etc.

## Security questions

- Who should have access to this database?
- Who should have access to which tables? Read-only access? Write access?
- Is this database critical to business operations?
- ...etc.

## Create a new database using SQLiteStudio

Database > Add a Database.

![](https://i.imgur.com/ioRzyif.png)

## `CREATE` statement

```sql
CREATE TABLE table_name (
    column_name DATA_TYPE CONSTRAINTS,
    column_name DATA_TYPE
);
```

In [24]:
DROP TABLE IF EXISTS movies;

In [25]:
CREATE TABLE movies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    year INTEGER,
    rating REAL
);

## After `CREATE` statement

In [26]:
SELECT *
  FROM movies;

Empty set (0.00 sec)

In [27]:
SELECT COUNT(*)
  FROM movies;

+----------+
| COUNT(*) |
+----------+
| 0        |
+----------+
1 row in set (0.00 sec)

In [28]:
INSERT INTO movies (title, year, rating)
VALUES 
    ('The Shawshank Redemption', 1994, 9.2),
    ('The Godfather', 1972, 9.1),
    ('The Dark Knight', 2008, 9.0),
    ('Forrest Gump', 1994, 8.8);

## After multiple `INSERT`s

In [29]:
SELECT *
  FROM movies;

+----+--------------------------+------+--------+
| id | title                    | year | rating |
+----+--------------------------+------+--------+
| 1  | The Shawshank Redemption | 1994 | 9.2    |
+----+--------------------------+------+--------+
| 2  | The Godfather            | 1972 | 9.1    |
+----+--------------------------+------+--------+
| 3  | The Dark Knight          | 2008 | 9      |
+----+--------------------------+------+--------+
| 4  | Forrest Gump             | 1994 | 8.8    |
+----+--------------------------+------+--------+
4 rows in set (0.00 sec)

In [30]:
SELECT COUNT(*)
  FROM movies;

+----------+
| COUNT(*) |
+----------+
| 4        |
+----------+
1 row in set (0.00 sec)

In [31]:
CREATE TABLE actors (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    movie_id INTEGER,
    FOREIGN KEY (movie_id) REFERENCES movies (id)
);

In [32]:
INSERT INTO actors (name, movie_id)
VALUES 
    ('Tim Robbins', 1),
    ('Morgan Freeman', 1),
    ('Marlon Brando', 2),
    ('Al Pacino', 2),
    ('Christian Bale', 3),
    ('Heath Ledger', 3),
    ('Tom Hanks', 4),
    ('Robin Wright', 4);

In [33]:
SELECT *
  FROM actors;

+----+----------------+----------+
| id | name           | movie_id |
+----+----------------+----------+
| 1  | Tim Robbins    | 1        |
+----+----------------+----------+
| 2  | Morgan Freeman | 1        |
+----+----------------+----------+
| 3  | Marlon Brando  | 2        |
+----+----------------+----------+
| 4  | Al Pacino      | 2        |
+----+----------------+----------+
| 5  | Christian Bale | 3        |
+----+----------------+----------+
| 6  | Heath Ledger   | 3        |
+----+----------------+----------+
| 7  | Tom Hanks      | 4        |
+----+----------------+----------+
| 8  | Robin Wright   | 4        |
+----+----------------+----------+
8 rows in set (0.00 sec)

In [34]:
SELECT *
  FROM movies
  JOIN actors
    ON movies.id = actors.movie_id;

+----+--------------------------+------+--------+----+----------------+----------+
| id | title                    | year | rating | id | name           | movie_id |
+----+--------------------------+------+--------+----+----------------+----------+
| 1  | The Shawshank Redemption | 1994 | 9.2    | 1  | Tim Robbins    | 1        |
+----+--------------------------+------+--------+----+----------------+----------+
| 1  | The Shawshank Redemption | 1994 | 9.2    | 2  | Morgan Freeman | 1        |
+----+--------------------------+------+--------+----+----------------+----------+
| 2  | The Godfather            | 1972 | 9.1    | 3  | Marlon Brando  | 2        |
+----+--------------------------+------+--------+----+----------------+----------+
| 2  | The Godfather            | 1972 | 9.1    | 4  | Al Pacino      | 2        |
+----+--------------------------+------+--------+----+----------------+----------+
| 3  | The Dark Knight          | 2008 | 9      | 5  | Christian Bale | 3        |
+----+--------------------------+------+--------+----+----------------+----------+
| 3  | The Dark Knight          | 2008 | 9      | 6  | Heath Ledger   | 3        |
+----+--------------------------+------+--------+----+----------------+----------+
| 4  | Forrest Gump             | 1994 | 8.8    | 7  | Tom Hanks      | 4        |
+----+--------------------------+------+--------+----+----------------+----------+
| 4  | Forrest Gump             | 1994 | 8.8    | 8  | Robin Wright   | 4        |
+----+--------------------------+------+--------+----+----------------+----------+
8 rows in set (0.00 sec)

In [35]:
PRAGMA foreign_keys=off;

In [36]:
DELETE FROM movies;

In [37]:
DELETE FROM actors;

In [38]:
PRAGMA foreign_keys=on;

## After `DELETE` statement

In [39]:
SELECT *
  FROM movies;

Empty set (0.00 sec)

In [40]:
SELECT *
  FROM actors;

Empty set (0.00 sec)

## `DROP` statement

```sql
DROP TABLE IF EXISTS table_name;
```

In [41]:
DROP TABLE IF EXISTS movies;

In [42]:
DROP TABLE IF EXISTS actors;

## After `DROP` statement

In [43]:
SELECT *
  FROM movies;

Error: sqlite3_statement_backend::prepare: no such table: movies while preparing "SELECT *
  FROM movies;".

In [44]:
SELECT *
  FROM actors;

Error: sqlite3_statement_backend::prepare: no such table: actors while preparing "SELECT *
  FROM actors;".

## We can also use SQLiteStudio to import CSV file as a table

![](https://i.imgur.com/qhMFMRP.png)

## Try to `DROP DATABASE covid19.db` and create from scratch

- [daily_report.csv](https://ntu-viz.s3.ap-northeast-1.amazonaws.com/covid19/daily_report.csv)
- [lookup_table.csv](https://ntu-viz.s3.ap-northeast-1.amazonaws.com/covid19/lookup_table.csv)
- [time_series.csv](https://ntu-viz.s3.ap-northeast-1.amazonaws.com/covid19/time_series.csv)

## What are views?

> In a database, a view is the result set of a stored query on the data, which the database users can query just as they would in a persistent database collection object. This pre-established query command is kept in the database dictionary.

Source: <https://en.wikipedia.org/wiki/View_(SQL)>

## Views are like

- A persistent sub-query.
- A stored `SELECT` statement that feels like a table for users.
- A feature lies between sub-queries and creating a table.

## `CREATE VIEW` statement

```sql
CREATE VIEW view_name (column_names)
    AS
SELECT ...;
```

## The incidence rate summary

In [45]:
SELECT lookup_table.Country_Region,
       SUM(daily_report.Confirmed)*100000 / SUM(lookup_table.Population) AS Incidence_Rate
  FROM daily_report
  JOIN lookup_table
    ON daily_report.Combined_Key = lookup_table.Combined_Key
 GROUP BY lookup_table.Country_Region
 ORDER BY Incidence_Rate DESC;

+----------------------------------+----------------+
| Country_Region                   | Incidence_Rate |
+----------------------------------+----------------+
| Andorra                          | 49180          |
+----------------------------------+----------------+
| Denmark                          | 47297          |
+----------------------------------+----------------+
| Slovenia                         | 42936          |
+----------------------------------+----------------+
| San Marino                       | 42338          |
+----------------------------------+----------------+
| Israel                           | 41990          |
+----------------------------------+----------------+
| Georgia                          | 40245          |
+----------------------------------+----------------+
| Seychelles                       | 40000          |
+----------------------------------+----------------+
| Slovakia                         | 38818          |
+----------------------------------+----------------+
| Iceland                          | 38049          |
+----------------------------------+----------------+
| Estonia                          | 37272          |
+----------------------------------+----------------+
| Netherlands                      | 36824          |
+----------------------------------+----------------+
| Montenegro                       | 36653          |
+----------------------------------+----------------+
| Latvia                           | 34626          |
+----------------------------------+----------------+
| France                           | 33580          |
+----------------------------------+----------------+
| Czechia                          | 33376          |
+----------------------------------+----------------+
| Lithuania                        | 33154          |
+----------------------------------+----------------+
| Switzerland                      | 32375          |
+----------------------------------+----------------+
| Portugal                         | 31996          |
+----------------------------------+----------------+
| Maldives                         | 31485          |
+----------------------------------+----------------+
| Liechtenstein                    | 31468          |
+----------------------------------+----------------+
| Belgium                          | 30952          |
+----------------------------------+----------------+
| Bahrain                          | 30259          |
+----------------------------------+----------------+
| Austria                          | 29753          |
+----------------------------------+----------------+
| Luxembourg                       | 29262          |
+----------------------------------+----------------+
| United Kingdom                   | 28326          |
+----------------------------------+----------------+
| Mongolia                         | 27702          |
+----------------------------------+----------------+
| Cyprus                           | 26712          |
+----------------------------------+----------------+
| Ireland                          | 26336          |
+----------------------------------+----------------+
| Croatia                          | 25693          |
+----------------------------------+----------------+
| Uruguay                          | 24252          |
+----------------------------------+----------------+
| Monaco                           | 23848          |
+----------------------------------+----------------+
| US                               | 23788          |
+----------------------------------+----------------+
| Sweden                           | 23637          |
+----------------------------------+----------------+
| Spain                            | 23387          |
+----------------------------------+----------------+
| Greece                           | 23233          |
+----------------------------------+----------------+
| Norway                           | 22912          |
+----------------------------------+----------------+
| Serbia                           | 21871          |
+----------------------------------+----------------+
| Italy                            | 21177          |
+----------------------------------+----------------+
| Palau                            | 20996          |
+----------------------------------+----------------+
| Argentina                        | 19693          |
+----------------------------------+----------------+
| Barbados                         | 19196          |
+----------------------------------+----------------+
| Hungary                          | 18503          |
+----------------------------------+----------------+
| Germany                          | 17933          |
+----------------------------------+----------------+
| Panama                           | 17509          |
+----------------------------------+----------------+
| Chile                            | 17415          |
+----------------------------------+----------------+
| Turkey                           | 16705          |
+----------------------------------+----------------+
| Malta                            | 16142          |
+----------------------------------+----------------+
| Jordan                           | 15992          |
+----------------------------------+----------------+
| Costa Rica                       | 15840          |
+----------------------------------+----------------+
| Bulgaria                         | 15705          |
+----------------------------------+----------------+
| Lebanon                          | 15657          |
+----------------------------------+----------------+
| Dominica                         | 15429          |
+----------------------------------+----------------+
| Poland                           | 14973          |
+----------------------------------+----------------+
| Brunei                           | 14524          |
+----------------------------------+----------------+
| Kuwait                           | 14515          |
+----------------------------------+----------------+
| North Macedonia                  | 14268          |
+----------------------------------+----------------+
| Belize                           | 14258          |
+----------------------------------+----------------+
| Romania                          | 14209          |
+----------------------------------+----------------+
| Armenia                          | 14168          |
+----------------------------------+----------------+
| Brazil                           | 13703          |
+----------------------------------+----------------+
| Suriname                         | 13333          |
+----------------------------------+----------------+
| Mauritius                        | 13181          |
+----------------------------------+----------------+
| Australia                        | 12706          |
+----------------------------------+----------------+
| West Bank and Gaza               | 12662          |
+----------------------------------+----------------+
| Colombia                         | 12566          |
+----------------------------------+----------------+
| Kosovo                           | 12497          |
+----------------------------------+----------------+
| Moldova                          | 12439          |
+----------------------------------+----------------+
| Qatar                            | 12390          |
+----------------------------------+----------------+
| Singapore                        | 12382          |
+----------------------------------+----------------+
| Saint Lucia                      | 12358          |
+----------------------------------+----------------+
| Grenada                          | 12166          |
+----------------------------------+----------------+
| Finland                          | 11510          |
+----------------------------------+----------------+
| Bosnia and Herzegovina           | 11314          |
+----------------------------------+----------------+
| Botswana                         | 11224          |
+----------------------------------+----------------+
| Russia                           | 11020          |
+----------------------------------+----------------+
| Ukraine                          | 10981          |
+----------------------------------+----------------+
| Peru                             | 10780          |
+----------------------------------+----------------+
| Malaysia                         | 10549          |
+----------------------------------+----------------+
| Saint Kitts and Nevis            | 10396          |
+----------------------------------+----------------+
| Cabo Verde                       | 10051          |
+----------------------------------+----------------+
| Belarus                          | 9733           |
+----------------------------------+----------------+
| Cuba                             | 9445           |
+----------------------------------+----------------+
| Albania                          | 9436           |
+----------------------------------+----------------+
| Trinidad and Tobago              | 9129           |
+----------------------------------+----------------+
| Paraguay                         | 8991           |
+----------------------------------+----------------+
| United Arab Emirates             | 8897           |
+----------------------------------+----------------+
| Canada                           | 8634           |
+----------------------------------+----------------+
| Tunisia                          | 8446           |
+----------------------------------+----------------+
| Bahamas                          | 8425           |
+----------------------------------+----------------+
| Iran                             | 8395           |
+----------------------------------+----------------+
| Guyana                           | 7999           |
+----------------------------------+----------------+
| Azerbaijan                       | 7748           |
+----------------------------------+----------------+
| Bolivia                          | 7653           |
+----------------------------------+----------------+
| Antigua and Barbuda              | 7594           |
+----------------------------------+----------------+
| Saint Vincent and the Grenadines | 7489           |
+----------------------------------+----------------+
| Oman                             | 7485           |
+----------------------------------+----------------+
| Kazakhstan                       | 7406           |
+----------------------------------+----------------+
| Libya                            | 7195           |
+----------------------------------+----------------+
| Fiji                             | 7131           |
+----------------------------------+----------------+
| Korea, South                     | 6384           |
+----------------------------------+----------------+
| South Africa                     | 6194           |
+----------------------------------+----------------+
| Namibia                          | 6187           |
+----------------------------------+----------------+
| Eswatini                         | 5961           |
+----------------------------------+----------------+
| Iraq                             | 5725           |
+----------------------------------+----------------+
| Dominican Republic               | 5296           |
+----------------------------------+----------------+
| Ecuador                          | 4691           |
+----------------------------------+----------------+
| Guatemala                        | 4336           |
+----------------------------------+----------------+
| Jamaica                          | 4322           |
+----------------------------------+----------------+
| Mexico                           | 4310           |
+----------------------------------+----------------+
| Honduras                         | 4151           |
+----------------------------------+----------------+
| Thailand                         | 4143           |
+----------------------------------+----------------+
| Japan                            | 3967           |
+----------------------------------+----------------+
| Holy See                         | 3584           |
+----------------------------------+----------------+
| Vietnam                          | 3537           |
+----------------------------------+----------------+
| Nepal                            | 3353           |
+----------------------------------+----------------+
| Philippines                      | 3341           |
+----------------------------------+----------------+
| Morocco                          | 3145           |
+----------------------------------+----------------+
| India                            | 3130           |
+----------------------------------+----------------+
| Kyrgyzstan                       | 3073           |
+----------------------------------+----------------+
| Sri Lanka                        | 3016           |
+----------------------------------+----------------+
| Sao Tome and Principe            | 2707           |
+----------------------------------+----------------+
| Kiribati                         | 2477           |
+----------------------------------+----------------+
| New Zealand                      | 2455           |
+----------------------------------+----------------+
| El Salvador                      | 2410           |
+----------------------------------+----------------+
| Saudi Arabia                     | 2140           |
+----------------------------------+----------------+
| Gabon                            | 2136           |
+----------------------------------+----------------+
| Indonesia                        | 2034           |
+----------------------------------+----------------+
| Laos                             | 1961           |
+----------------------------------+----------------+
| Venezuela                        | 1811           |
+----------------------------------+----------------+
| Timor-Leste                      | 1721           |
+----------------------------------+----------------+
| Zambia                           | 1701           |
+----------------------------------+----------------+
| Bhutan                           | 1646           |
+----------------------------------+----------------+
| Zimbabwe                         | 1590           |
+----------------------------------+----------------+
| Djibouti                         | 1573           |
+----------------------------------+----------------+
| Lesotho                          | 1522           |
+----------------------------------+----------------+
| Mauritania                       | 1261           |
+----------------------------------+----------------+
| Bangladesh                       | 1180           |
+----------------------------------+----------------+
| Equatorial Guinea                | 1132           |
+----------------------------------+----------------+
| Burma                            | 1080           |
+----------------------------------+----------------+
| Solomon Islands                  | 1079           |
+----------------------------------+----------------+
| Rwanda                           | 999            |
+----------------------------------+----------------+
| Comoros                          | 923            |
+----------------------------------+----------------+
| Cambodia                         | 779            |
+----------------------------------+----------------+
| Pakistan                         | 726            |
+----------------------------------+----------------+
| Mozambique                       | 720            |
+----------------------------------+----------------+
| Uzbekistan                       | 706            |
+----------------------------------+----------------+
| Algeria                          | 604            |
+----------------------------------+----------------+
| Kenya                            | 600            |
+----------------------------------+----------------+
| Ghana                            | 513            |
+----------------------------------+----------------+
| Senegal                          | 511            |
+----------------------------------+----------------+
| Gambia                           | 494            |
+----------------------------------+----------------+
| Egypt                            | 472            |
+----------------------------------+----------------+
| Papua New Guinea                 | 461            |
+----------------------------------+----------------+
| Cameroon                         | 449            |
+----------------------------------+----------------+
| Malawi                           | 446            |
+----------------------------------+----------------+
| Afghanistan                      | 446            |
+----------------------------------+----------------+
| Togo                             | 444            |
+----------------------------------+----------------+
| Congo (Brazzaville)              | 435            |
+----------------------------------+----------------+
| Ethiopia                         | 407            |
+----------------------------------+----------------+
| Guinea-Bissau                    | 406            |
+----------------------------------+----------------+
| Uganda                           | 357            |
+----------------------------------+----------------+
| Tonga                            | 335            |
+----------------------------------+----------------+
| Burundi                          | 320            |
+----------------------------------+----------------+
| Syria                            | 311            |
+----------------------------------+----------------+
| Cote d'Ivoire                    | 308            |
+----------------------------------+----------------+
| Angola                           | 300            |
+----------------------------------+----------------+
| Central African Republic         | 294            |
+----------------------------------+----------------+
| Guinea                           | 277            |
+----------------------------------+----------------+
| Eritrea                          | 273            |
+----------------------------------+----------------+
| Nicaragua                        | 271            |
+----------------------------------+----------------+
| Haiti                            | 266            |
+----------------------------------+----------------+
| Madagascar                       | 229            |
+----------------------------------+----------------+
| Benin                            | 219            |
+----------------------------------+----------------+
| Tajikistan                       | 186            |
+----------------------------------+----------------+
| Somalia                          | 165            |
+----------------------------------+----------------+
| South Sudan                      | 151            |
+----------------------------------+----------------+
| Mali                             | 150            |
+----------------------------------+----------------+
| Liberia                          | 145            |
+----------------------------------+----------------+
| Sudan                            | 140            |
+----------------------------------+----------------+
| Nigeria                          | 123            |
+----------------------------------+----------------+
| Burkina Faso                     | 99             |
+----------------------------------+----------------+
| Sierra Leone                     | 96             |
+----------------------------------+----------------+
| Congo (Kinshasa)                 | 96             |
+----------------------------------+----------------+
| Taiwan                           | 86             |

In [46]:
DROP VIEW IF EXISTS incidence_rate_by_country;

In [47]:
CREATE VIEW incidence_rate_by_country
    AS
SELECT lookup_table.Country_Region,
       SUM(daily_report.Confirmed)*100000 / SUM(lookup_table.Population) AS Incidence_Rate
  FROM daily_report
  JOIN lookup_table
    ON daily_report.Combined_Key = lookup_table.Combined_Key
 GROUP BY lookup_table.Country_Region
 ORDER BY Incidence_Rate DESC;

## Once a view is created, use it like a table

In [48]:
SELECT *
  FROM incidence_rate_by_country
 WHERE Country_Region = 'Taiwan';

+----------------+----------------+
| Country_Region | Incidence_Rate |
+----------------+----------------+
| Taiwan         | 86             |
+----------------+----------------+
1 row in set (0.00 sec)

## Using views to demonstrate different `JOIN`s

In [49]:
DROP VIEW IF EXISTS daily_report_tw_kr;

In [50]:
CREATE VIEW daily_report_tw_kr
    AS
SELECT *
  FROM daily_report
 WHERE Combined_Key IN ('Taiwan', 'Korea, South');

In [51]:
DROP VIEW IF EXISTS lookup_table_tw_sg;

In [52]:
CREATE VIEW lookup_table_tw_sg
    AS
SELECT *
  FROM lookup_table
 WHERE iso2 IN ('TW', 'SG');

## `JOIN` returns rows from the left and the right table where matching values are found

In [53]:
SELECT daily_report_tw_kr.Combined_Key,
       daily_report_tw_kr.Confirmed,
       lookup_table_tw_sg.Population
  FROM daily_report_tw_kr
  JOIN lookup_table_tw_sg
    ON daily_report_tw_kr.Combined_Key = lookup_table_tw_sg.Combined_Key;

+--------------+-----------+------------+
| Combined_Key | Confirmed | Population |
+--------------+-----------+------------+
| Taiwan       | 20489     | 23816775   |
+--------------+-----------+------------+
1 row in set (0.00 sec)

## `LEFT JOIN` returns all rows from the left table and display blank rows from the other table if no matching values are found

In [54]:
SELECT daily_report_tw_kr.Combined_Key,
       daily_report_tw_kr.Confirmed,
       lookup_table_tw_sg.Population
  FROM daily_report_tw_kr
  LEFT JOIN lookup_table_tw_sg
    ON daily_report_tw_kr.Combined_Key = lookup_table_tw_sg.Combined_Key;

+--------------+-----------+------------+
| Combined_Key | Confirmed | Population |
+--------------+-----------+------------+
| Korea, South | 3273449   | NULL       |
+--------------+-----------+------------+
| Taiwan       | 20489     | 23816775   |
+--------------+-----------+------------+
2 rows in set (0.00 sec)

## `DROP` statement

```sql
DROP VIEW IF EXISTS view_name;
```

In [55]:
DROP VIEW IF EXISTS daily_report_tw_kr;

In [56]:
DROP VIEW IF EXISTS lookup_table_tw_sg;

## After `DROP` statement

In [57]:
SELECT *
  FROM daily_report_tw_kr;

Error: sqlite3_statement_backend::prepare: no such table: daily_report_tw_kr while preparing "SELECT *
  FROM daily_report_tw_kr;".

In [58]:
SELECT *
  FROM lookup_table_tw_sg;

Error: sqlite3_statement_backend::prepare: no such table: lookup_table_tw_sg while preparing "SELECT *
  FROM lookup_table_tw_sg;".

## The `covid19.db` database

## Data sources

- `lookup_table`: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/UID_ISO_FIPS_LookUp_Table.csv>
- `daily_report`: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/02-28-2022.csv>
- `time_series`
    - Confirmed: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv>
    - Deaths: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv>

## The ETL steps

1. Extract.
2. Transform.
3. Load.

Source: <https://nbviewer.org/github/datainpoint/classroom-data-visualization-with-modern-data-science-2022/blob/main/get_covid19_data.ipynb>

## Extract and Transform

```python
covid19 = Covid19()
lookup_table = covid19.get_lookup_table()
daily_report = covid19.get_daily_report('02-28-2022')
time_series = covid19.get_time_series()
```

## Load

```python
con = sqlite3.connect('covid19.db')
lookup_table.to_sql('lookup_table', con, if_exists='replace', index=False)
daily_report.to_sql('daily_report', con, if_exists='replace', index=False)
time_series.to_sql('time_series', con, if_exists='replace', index=False)
cur = con.cursor()
```

## Load: `lookup_table`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE lookup_table RENAME TO lookup_table_no_keys;
CREATE TABLE lookup_table (
    UID INTEGER,
    Combined_Key TEXT,
    iso2 TEXT,
    iso3 TEXT,
    Country_Region TEXT,
    Province_State TEXT,
    Admin2 TEXT,
    Lat REAL,
    Long_ REAL,
    Population INTEGER,
    PRIMARY KEY (UID)
);
INSERT INTO lookup_table SELECT * FROM lookup_table_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load: `daily_report`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE daily_report RENAME TO daily_report_no_keys;
CREATE TABLE daily_report (
    Combined_Key TEXT,
    Last_Update TEXT,
    Confirmed INTEGER,
    Deaths INTEGER,
    PRIMARY KEY (Combined_Key),
    FOREIGN KEY (Combined_Key) REFERENCES lookup_table (Combined_Key) 
            ON DELETE CASCADE ON UPDATE NO ACTION
);
INSERT INTO daily_report SELECT * FROM daily_report_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load: `time_series`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE time_series RENAME TO time_series_no_keys;
CREATE TABLE time_series (
    Date TEXT,
    Country_Region TEXT,
    Confirmed INTEGER,
    Deaths INTEGER,
    Daily_Cases INTEGER,
    Daily_Deaths INTEGER,
    PRIMARY KEY (Date, Country_Region),
    FOREIGN KEY (Country_Region) REFERENCES lookup_table (Country_Region) 
            ON DELETE CASCADE ON UPDATE NO ACTION
);
INSERT INTO time_series SELECT * FROM time_series_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load(Cont'd)

```sql
DROP TABLE lookup_table_no_keys;
DROP TABLE daily_report_no_keys;
DROP TABLE time_series_no_keys;
```

## ER diagram

> An entity–relationship model (or ER model) describes interrelated things of interest in a specific domain of knowledge. A basic ER model is composed of entity types (which classify the things of interest) and specifies relationships that can exist between entities (instances of those entity types).

Source: <https://en.wikipedia.org/wiki/Entity%E2%80%93relationship_model>

## ER diagram of `covid19.db`

![](https://i.imgur.com/FuQXsEj.png)